# -*- mode:org; ispell-local-dictionary: "spanish" -*-
#+TITLE:     Código para el Tuenti Challenge 8
#+AUTHOR:    Almira Molla, Alejandro
#+EMAIL:     aalmiramolla@gmail.com
#+LANGUAGE:  es
#+COLUMNS: %60ITEM(Task) %Effort(E){:} %CLOCKSUM(S) %15DEADLINE %15TAGS
#+STARTUP: overview

* Challenge 1 - Waffle love
#+BEGIN_SRC python :tangle challenge1/challenge1.py :results output
  #!/usr/bin/env python
  # coding: utf-8

  def how_many_squares(line):
      n,m = line.split()
      return ((int(n)-1)*(int(m)-1))

  if __name__=='__main__':
      with open('challenge1/submitInput') as f:
          lines = f.readlines()
          c = map(how_many_squares, lines[1:])
          for idx, value in enumerate(c):
              print('Case #{}: {}'.format(idx+1,value))
#+END_SRC
#+RESULTS:
#+begin_example
Case #1: 53465
Case #2: 323730
Case #3: 222346
Case #4: 1367254
Case #5: 2256045
Case #6: 1806314
Case #7: 2545777
Case #8: 2588760
Case #9: 3021035
Case #10: 2598421
Case #11: 3336010
Case #12: 1828236
Case #13: 4018313
Case #14: 3158974
Case #15: 2348982
Case #16: 4224636
Case #17: 3207369
Case #18: 5459220
Case #19: 5504688
Case #20: 4457376
Case #21: 5630636
Case #22: 4674810
Case #23: 83685
Case #24: 6753670
Case #25: 5238433
Case #26: 5775915
Case #27: 3217140
Case #28: 4323906
Case #29: 962634
Case #30: 8712200
Case #31: 7564308
Case #32: 7285706
Case #33: 6609207
Case #34: 10336032
Case #35: 10107245
Case #36: 6705972
Case #37: 8854560
Case #38: 986960
Case #39: 12022120
Case #40: 3598682
Case #41: 5382780
Case #42: 13972940
Case #43: 16193372
Case #44: 9552180
Case #45: 14713396
Case #46: 5205489
Case #47: 15397440
Case #48: 15626776
Case #49: 13904499
Case #50: 17655792
Case #51: 11594597
Case #52: 19905144
Case #53: 19427101
Case #54: 21617578
Case #55: 20594140
Case #56: 1623778
Case #57: 13536704
Case #58: 10842882
Case #59: 8067456
Case #60: 23706441
Case #61: 25079784
Case #62: 25422830
Case #63: 14977944
Case #64: 24711485
Case #65: 21598401
Case #66: 28024240
Case #67: 15211101
Case #68: 24695860
Case #69: 19146148
Case #70: 32834016
Case #71: 18573915
Case #72: 33359040
Case #73: 38568688
Case #74: 37009302
Case #75: 32930420
Case #76: 38020494
Case #77: 38584220
Case #78: 45618240
Case #79: 44862650
Case #80: 43805070
Case #81: 47005850
Case #82: 40902803
Case #83: 48512369
Case #84: 45059266
Case #85: 50825784
Case #86: 52553280
Case #87: 57019811
Case #88: 58621710
Case #89: 59293110
Case #90: 60841865
Case #91: 59838760
Case #92: 60212900
Case #93: 66855110
Case #94: 65526780
Case #95: 67698255
Case #96: 69916990
Case #97: 72246512
Case #98: 76408464
Case #99: 82328087
Case #100: 94991017
#+end_example
* Challenge 2 - Hidden numbers
#+BEGIN_SRC python :tangle challenge2/challenge2.py :results output
  #!/usr/bin/env python
  # coding: utf-8

  def difference(line):
      return 1


  if __name__=='__main__':
      with open('challenge2/testInput') as f:
          lines = f.readlines()
          c = map(difference, lines[1:])
          for idx, value in enumerate(c):
              print('Case #{}: {}'.format(idx+1,value))
#+END_SRC

#+RESULTS:
#+begin_example
Case #1: 1
Case #2: 1
Case #3: 1
Case #4: 1
Case #5: 1
Case #6: 1
Case #7: 1
Case #8: 1
Case #9: 1
Case #10: 1
Case #11: 1
Case #12: 1
Case #13: 1
Case #14: 1
Case #15: 1
Case #16: 1
Case #17: 1
Case #18: 1
Case #19: 1
Case #20: 1
Case #21: 1
Case #22: 1
Case #23: 1
Case #24: 1
Case #25: 1
Case #26: 1
Case #27: 1
Case #28: 1
Case #29: 1
Case #30: 1
Case #31: 1
Case #32: 1
Case #33: 1
Case #34: 1
Case #35: 1
Case #36: 1
Case #37: 1
Case #38: 1
Case #39: 1
Case #40: 1
Case #41: 1
Case #42: 1
Case #43: 1
Case #44: 1
Case #45: 1
Case #46: 1
Case #47: 1
Case #48: 1
Case #49: 1
Case #50: 1
Case #51: 1
Case #52: 1
Case #53: 1
Case #54: 1
Case #55: 1
Case #56: 1
Case #57: 1
Case #58: 1
Case #59: 1
Case #60: 1
Case #61: 1
Case #62: 1
Case #63: 1
Case #64: 1
Case #65: 1
Case #66: 1
Case #67: 1
Case #68: 1
Case #69: 1
Case #70: 1
Case #71: 1
Case #72: 1
Case #73: 1
Case #74: 1
Case #75: 1
Case #76: 1
Case #77: 1
Case #78: 1
Case #79: 1
Case #80: 1
Case #81: 1
Case #82: 1
Case #83: 1
Case #84: 1
Case #85: 1
Case #86: 1
Case #87: 1
Case #88: 1
Case #89: 1
Case #90: 1
Case #91: 1
Case #92: 1
Case #93: 1
Case #94: 1
Case #95: 1
Case #96: 1
Case #97: 1
Case #98: 1
Case #99: 1
Case #100: 1
#+end_example
